"""def repeats(arr):
    count = {}
    for num in arr:
        if num in count:
            count[num] = count[num] + 1
        else:
            count[num] = 1
    sum_once = 0
    for num in count:
        if count[num] == 1:
            sum_once = sum_once + num
    return sum_once"""

#count = {} ქმნის ცარიელ ლექსიკონს და ვიყენებთ რომ დავითვალოთ თითოეული რიცხვის შემთხვევა.

#for num in arr: და if 


#ეს ციკლი მეორდება შეყვანის სიაში arr-ის თითოეულ რიცხვზე.
#if ამოწმებს არის თუ არა ნომერი num უკვე დათვლის ლექსიკონში.
#თუ ასეა, ჩვენ ვამატებთ მის რაოდენობას 1-ით count[num] = count[num] + 1 გამოყენებით. ეს ნიშნავს, რომ ჩვენ უკვე ვნახეთ ეს რიცხვი, ამიტომ მის რაოდენობას ვამატებთ 1-ს.
#თუ ეს ასე არ არის, ჩვენ ვამატებთ მას ლექსიკონში 1-ის დათვლით count[num] = 1-ის გამოყენებით. ეს ნიშნავს, რომ ჩვენ პირველად ვნახეთ ეს რიცხვი, ამიტომ მისი რაოდენობა 1-ზე დავაყენეთ.