def reverse_alternate(st):
    wordss = st.split()
    result = []
    
    
    for i in range(len(wordss)):
        if i % 2 != 0:
            result.append(wordss[i][::-1])
        else:
            result.append(wordss[i])
    return " ".join(result)



"""
1. დავადეკლარირეთ ფუნქცია სახელად reverse_alternate რომელსაც გავუწერეთ st პარამეტრი
2. სტრინგი გადავაქციეთ სიად ( გავხლიჩეთ ) split() ფუნქციის დახმარებით
3. შევქმენით ცვლადი სადაც შევინახავთ სიას - [].

4. თუ i % 2 != 0: ამოწმებს, არის თუ არა მიმდინარე სიტყვის ინდექსი კენტი (1, 3, 5 და ა.შ.).
    თუ ლუწია, result.append(wordss[i][::-1]) აბრუნებს სიტყვას და ამატებს შედეგს.
    [::-1] slice აღნიშვნა აბრუნებს სტრიქონს.
    სხვა: ლუწი ინდექსებისთვის (0, 2, 4 და ა.შ.), სიტყვა ემატება შედეგს უცვლელად.

"""