def multiply_all(arr: list):
    def mult(number):
        return [i * number for i in arr]
    return mult

"""
def multiply_all(arr: list): განსაზღვრავს ფუნქციას, რომელიც არგუმენტად იღებს სიის arr-ს.
: სია არის ტიპის მინიშნება, რომელიც ვარაუდობს, რომ arr უნდა იყოს სია.

"""

"""
multiply_all-ის შიგნით განსაზღვრულია სხვა ფუნქცია mult.
ეს შიდა ფუნქცია იღებს ერთი პარამეტრის რიცხვს.

"""

"""
mult ფუნქცია იყენებს სიის გააზრებას ახალი სიის შესაქმნელად.
ის ამრავლებს i-ის თითოეულ ელემენტს arr რიცხვით.

"""

"""
 ფუნქცია multiply_all აბრუნებს შიდა ფუნქციას mult,  მისი გამოძახების გარეშე.
ეს ქმნის დახურვას, სადაც mult "იმახსოვრებს" arr-ს მისი დახურვის არედან.

"""

