#class Cat(animal):
    #def __init__(self, kitten_name):
        #self.name = kitten_name
    
    #def speak(self):
        #return '{} meows.'.format(self.name)
    
"""
Class განმარტება:

ის ქმნის ახალ კლასს, სახელად Cat.
ეს კლასი მემკვიდრეობით იღებს სხვა კლასს, რომელსაც ეწოდება animal, 
რაც ვარაუდობს, რომ კატა არის animal-ის სპეციფიკური ტიპი.

"""

"""
ობიექტის ინიციალიზაცია:

__init__ მეთოდი გამოიყენება ახალი Cat ობიექტების დასაყენებლად.
როდესაც ახალი Cat იქმნება, მას ეძლევა სახელი (kitten_name).
ეს სახელი ინახება როგორც Cat ობიექტის ატრიბუტი.

"""

"""
Speak განმარტება:

Speak მეთოდი განსაზღვრავს კატების სპეციფიკურ ქცევას.
ის აბრუნებს სტრიქონს, რომელშიც აღწერილია, თუ როგორ "ლაპარაკობს" კატა (meow), მათ შორის კატის სახელი.

"""